app/controllers/people_controller.rb

SELECT * FROM "roles"
SELECT * FROM "genders"
SELECT * FROM "work_patterns"
SELECT * FROM "service_lengths"
SELECT * FROM "question_lists"
---
  def edit
		@roles = Role.all
		@gender = Gender.all
		@workpattern = WorkPattern.all
		@servicelength = ServiceLength.all
		@questionlist = QuestionList.all