app/controllers/question_lists_controller.rb

SELECT * FROM "question_lists"
---
  def index
    @question_lists = QuestionList.all